Repository: Sebas38760/XP_Modification
Catalog: translations/wesnoth-XP_Modification/*.po
Languages: es

source: +$Rav_XP_hp_amount hp: $Rav_XP_hp_cost xp
es: +$Rav_XP_hp_amount PV: $Rav_XP_hp_cost PX

source: +$Rav_XP_hp_amount hp: $Rav_XP_hp_cost_drainer xp
es: +$Rav_XP_hp_amount PV: $Rav_XP_hp_cost_drainer PX

source: +$Rav_XP_move_amount movement: $Rav_XP_move_cost xp
es: +$Rav_XP_move_amount movimiento: $Rav_XP_move_cost PX

source: +$Rav_XP_move_amount movement: $Rav_XP_move_cost_drainer xp
es: +$Rav_XP_move_amount movimiento: $Rav_XP_move_cost_drainer PX

source: +$Rav_XP_damage_amount damage: $Rav_XP_damage_cost xp
es: +$Rav_XP_damage_amount daño: $Rav_XP_damage_cost PX

source: +$Rav_XP_damage_amount damage: $Rav_XP_damage_cost_drainer xp
es: +$Rav_XP_damage_amount daño: $Rav_XP_damage_cost_drainer PX

source: +$Rav_XP_strike_amount strike: $Rav_XP_strike_cost xp
es: +$Rav_XP_strike_amount ataque: $Rav_XP_strike_cost PX

source: +$Rav_XP_strike_amount strike: $Rav_XP_strike_cost_drainer xp
es: +$Rav_XP_strike_amount ataque: $Rav_XP_strike_cost_drainer PX

source: Spend XP to upgrade units damage/strikes/health/movement. version 2.4.3 by Ravana - based on work by vn971, Dovolente, itota and Nosmos Units with drain ability have higher upgrade cost
es: Gasta PX para mejorar el daño/ataques/salud/movimiento de las unidades. versión 2.4.3 por Ravana - basado en el trabajo de vn971, Dovolente, itota y Nosmos Las unidades con la habilidad de drenaje tienen un coste de mejora más alto

source: AMLA only
es: Solo tras máximo nivel

source: Allow upgrades only on units that reached their max level
es: Permitir mejoras solo en unidades que han alcanzado su nivel máximo

source: HP enabled
es: PV activados

source: Hitpoints upgrades on/off
es: Mejoras de puntos de vida activadas/desactivadas

source: MP enabled
es: Movimiento activado

source: Movement upgrades on/off
es: Mejoras de movimiento activadas/desactivadas

source: DMG enabled
es: Daño activado

source: Damage upgrades on/off
es: Mejoras de daño activadas/desactivadas

source: Strikes enabled
es: Ataques activados

source: Strikes upgrades on/off
es: Mejoras de ataques activadas/desactivadas

source: HP cost
es: Coste de PV

source: XP required to upgrade hitpoints
es: PX requeridos para mejorar los puntos de vida

source: MP cost
es: Coste de movimiento

source: XP required to upgrade movement
es: PX requeridos para mejorar el movimiento

source: DMG cost
es: Coste de daño

source: XP required to upgrade damage
es: PX requeridos para mejorar el daño

source: Strike cost
es: Coste de ataques

source: XP required to upgrade strikes
es: PX requeridos para mejorar los ataques

source: Drainer penalty %
es: Penalización de drenadores %

source: XP cost penalty for drainers, in percent
es: Penalización de coste de PX para drenadores, en porcentaje

source: %s the %s
es: %s el %s

source: I spent %s xp for %s!
es: ¡Gasté %s PX por %s!

source: XP Modification
es: XP Mod

source: WARNING Settings not found. Expected cause is bug #23512. Fix is enabling Advanced Settings->Level options in campaign menu. Default settings assumed.
es: ADVERTENCIA No se encontraron las configuraciones. La causa probable es el error #23512. La solución es activar Opciones avanzadas->Opciones de nivel en el menú de campaña. Se asumen las configuraciones predeterminadas.

source: Hitpoints cost:
es: Costo de PV:

source: Movement cost:
es: Costo de movimiento:

source: Damage cost:
es: Costo del daño:

source: Strikes cost:
es: Costo de ataques:

source: AMLA only: yes
es: Solo tras máximo nivel: sí

source: AMLA only: no
es: Solo tras máximo nivel: no

source: Experiment where damage and strike upgrades are automatically distributed and upgrade amount is 10% of base value instead of constant. Distribution aims to reach 3.5 damage per strike. May be enabled together with regular XP Mod, but disable strike and damage upgrades there then or amounts can be unexpected. Drain and amla-only logic is not implemented yet. When base damage or strike is 1, then upgrade is allowed to reduce the other value by 25% to achieve more evenly distributed damage and strikes. When unit has multiple attacks with same name, upgrade takes lowest values from all of them. So 40-1 and 4-10 with same name are 4-1 for upgrade purpose. Attacks that are not from unit type might get upgraded, but not tested. version 2.4.3 by Ravana
es: Experimento donde las mejoras de daño y ataques se distribuyen automáticamente y la cantidad de mejora es el 10% del valor base en lugar de constante. La distribución busca alcanzar 3.5 de daño por ataque. Puede activarse junto con el XP Mod normal, pero entonces desactiva las mejoras de ataques y daño allí o los valores pueden ser inesperados. La lógica de drenaje y solo tras máximo nivel aún no está implementada. Cuando el daño o los ataques base son 1, la mejora permite reducir el otro valor en un 25% para lograr una distribución más equilibrada de daño y ataques. Cuando una unidad tiene varios ataques con el mismo nombre, la mejora toma los valores más bajos de todos ellos. Así, 40-1 y 4-10 con el mismo nombre se consideran 4-1 para fines de mejora. Los ataques que no provienen del tipo de unidad podrían mejorarse, pero no se ha probado. versión 2.4.3 por Ravana

source: XP required to upgrade total power
es: PX requeridos para mejorar el poder total

source: +$Rav_XP_damage_percent|% base damage: $Rav_XP_damage_cost_beta xp
es: +$Rav_XP_damage_percent|% daño base: $Rav_XP_damage_cost_beta PX

source: Power cost:
es: Costo de energía:
